Tekla Open API Reference for Tekla Structures 2025
SectionMarkBase.SectionMarkAttributes.LeftSymbol Property
 The symbol to use on the left side of the section mark.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public SectionMarkBase.SectionMarkSymbol LeftSymbol { get; set; }
Public Property LeftSymbol As SectionMarkBase.SectionMarkSymbol
	Get
	Set
Property Value
Type: SectionMarkBase.SectionMarkSymbol
See Also
Reference
SectionMarkBase.SectionMarkAttributes Class
Tekla.Structures.Drawing Namespace